app/views/devise/registrations/new.html.erb

SELECT "focuses".* FROM "focuses" WHERE "focuses"."id" IN (1, 2, 5)
---
				<%= f.label :user_focus_ids_, "Company's Focus", :class => 'control-label' %>
				<% for focus in Focus.find(:all) %>

SELECT "focus".* FROM "focus"
SELECT "focuses".id FROM "focuses" INNER JOIN "focuses_users" ON "focuses"."id" = "focuses_users"."focus_id" WHERE "focuses_users"."user_id" IS NULL
SELECT 1 AS one FROM "focus" INNER JOIN "focus_users" ON "focus"."id" = "focus_users"."focus_id" WHERE "focus_users"."user_id" IS NULL AND "focus"."id" = 1 LIMIT 1
SELECT 1 AS one FROM "focuses" INNER JOIN "focuses_users" ON "focuses"."id" = "focuses_users"."focus_id" WHERE "focuses_users"."user_id" IS NULL AND "focuses"."id" = 1 LIMIT 1
---

					<%= check_box_tag "user[focus_ids][]", focus.id, @user.focuses.include?(focus) %>

SELECT "stages".* FROM "stages"
---
				<div class="controls">
					<%= collection_select(:stage_id, :id, Stage.all, :id, :name) %>