app/controllers/home_controller.rb

  def index
    @news_items = NewsItem.limit(3).order("created_at DESC")
---
SELECT "news_items".* FROM "news_items" ORDER BY created_at DESC LIMIT 3