app/controllers/news_items_controller.rb

SELECT "news_items".* FROM "news_items"
---
  def index
    @news_items = NewsItem.all

SELECT "news_items".* FROM "news_items" WHERE "news_items"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @news_item = NewsItem.find(params[:id])

INSERT INTO "news_items" ("abstract", "author", "content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @news_item = NewsItem.new(params[:news_item])

    respond_to do |format|
      if @news_item.save